---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialType.RemoveGroundConductorSize(Autodesk.Revit.DB.Electrical.GroundConductorSize)
source: html/772b5f7e-7bf6-d462-158a-78905761388c.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialType.RemoveGroundConductorSize Method

Remove an existing ground conductor size from this material type.

## Syntax (C#)
```csharp
public void RemoveGroundConductorSize(
	GroundConductorSize grdConductorSize
)
```

## Parameters
- **grdConductorSize** (`Autodesk.Revit.DB.Electrical.GroundConductorSize`) - The ground size type to be removed.